Revit 2027 API
ParameterFilterUtilities.RemoveUnfilterableCategories Method
 Removes from the given set the categories that are not filterable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> RemoveUnfilterableCategories(
	ICollection<ElementId> categories
)
Public Shared Function RemoveUnfilterableCategories (
	categories As ICollection(Of ElementId)
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ RemoveUnfilterableCategories(
	ICollection<ElementId^>^ categories
)
static member RemoveUnfilterableCategories :
        categories : ICollection<ElementId> -> ICollection<ElementId>
Parameters
categories ICollection<ElementId>
 The set of categories to check.
Return Value
ICollection<ElementId>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterFilterUtilities Class
Autodesk.Revit.DB Namespace